Case1_2DCS49_FineMesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    // piece 1
    ( -0.8000000000  -0.0002000000  0.1585660172 ) // 0
    ( -0.1060660172  -0.0002000000  0.1585660172 ) // 1
    ( -0.1060660172  0.0002000000  0.1585660172 ) // 2
    ( -0.8000000000  0.0002000000  0.1585660172 ) // 3
    ( -0.8000000000  -0.0002000000  0.5000000000 ) // 4
    ( -0.1060660172  -0.0002000000  0.5000000000 ) // 5
    ( -0.1060660172  0.0002000000  0.5000000000 ) // 6
    ( -0.8000000000  0.0002000000  0.5000000000 ) // 7

    ( 0.1060660172  -0.0002000000  0.1585660172 ) // 8
    ( 0.8000000000  -0.0002000000  0.1585660172 ) // 9
    ( 0.8000000000  0.0002000000  0.1585660172 ) // 10
    ( 0.1060660172  0.0002000000  0.1585660172 ) // 11
    ( 0.1060660172  -0.0002000000  0.5000000000 ) // 12
    ( 0.8000000000  -0.0002000000  0.5000000000 ) // 13
    ( 0.8000000000  0.0002000000  0.5000000000 ) // 14
    ( 0.1060660172  0.0002000000  0.5000000000 ) // 15

    ( 0.1060660172  -0.0002000000  -0.3000000000 ) // 16
    ( 0.8000000000  -0.0002000000  -0.3000000000 ) // 17
    ( 0.8000000000  0.0002000000  -0.3000000000 ) // 18
    ( 0.1060660172  0.0002000000  -0.3000000000 ) // 19
    ( 0.1060660172  -0.0002000000  -0.0535660172 ) // 20
    ( 0.8000000000  -0.0002000000  -0.0535660172 ) // 21
    ( 0.8000000000  0.0002000000  -0.0535660172 ) // 22
    ( 0.1060660172  0.0002000000  -0.0535660172 ) // 23

    ( -0.8000000000  -0.0002000000  -0.3000000000 ) // 24
    ( -0.1060660172  -0.0002000000  -0.3000000000 ) // 25
    ( -0.1060660172  0.0002000000  -0.3000000000 ) // 26
    ( -0.8000000000  0.0002000000  -0.3000000000 ) // 27
    ( -0.8000000000  -0.0002000000  -0.0535660172 ) // 28
    ( -0.1060660172  -0.0002000000  -0.0535660172 ) // 29
    ( -0.1060660172  0.0002000000  -0.0535660172 ) // 30
    ( -0.8000000000  0.0002000000  -0.0535660172 ) // 31

    ( -0.0371231060  -0.0002000000  0.0896231060 ) // 32
    ( 0.0371231060  -0.0002000000  0.0896231060 ) // 33
    ( 0.0371231060  0.0002000000  0.0896231060 ) // 34
    ( -0.0371231060  0.0002000000  0.0896231060 ) // 35

    ( -0.0371231060  -0.0002000000  0.0153768940 ) // 36
    ( 0.0371231060  -0.0002000000  0.0153768940 ) // 37
    ( 0.0371231060  0.0002000000  0.0153768940 ) // 38
    ( -0.0371231060  0.0002000000  0.0153768940 ) // 39
);

blocks
(
    // piece 1
    hex ( 0 1 2 3 4 5 6 7 ) ( 70 1 50 ) simpleGrading ( 0.3836217015 1.0000000000 1.5734617258 ) // hex1
    hex ( 8 9 10 11 12 13 14 15 ) ( 70 1 50 ) simpleGrading ( 2.6067346974 1.0000000000 1.5734617258 ) // hex2
    hex ( 16 17 18 19 20 21 22 23 ) ( 70 1 35 ) simpleGrading ( 2.6067346974 1.0000000000 0.5854299325 ) // hex3
    hex ( 24 25 26 27 28 29 30 31 ) ( 70 1 35 ) simpleGrading ( 0.3836217015 1.0000000000 0.5854299325 ) // hex4

    hex ( 1 8 11 2 5 12 15 6 ) ( 41 1 50 ) simpleGrading ( 1.0000000000 1.0000000000 1.5734617258 ) // hex5
    hex ( 20 21 22 23 8 9 10 11 ) ( 70 1 41 ) simpleGrading ( 2.6067346974 1.0000000000 1.0000000000 ) // hex6
    hex ( 25 16 19 26 29 20 23 30 ) ( 41 1 35 ) simpleGrading ( 1.0000000000 1.0000000000 0.5854299325 ) // hex7
    hex ( 28 29 30 31 0 1 2 3 ) ( 70 1 41 ) simpleGrading ( 0.3836217015 1.0000000000 1.0000000000 ) // hex8

    hex ( 32 33 34 35 1 8 11 2 ) ( 41 1 28 ) simpleGrading ( 1.0000000000 1.0000000000 2.7655221204 ) // hex9
    hex ( 37 20 23 38 33 8 11 34 ) ( 28 1 41 ) simpleGrading ( 2.7655221204 1.0000000000 1.0000000000 ) // hex10
    hex ( 29 20 23 30 36 37 38 39 ) ( 41 1 28 ) simpleGrading ( 1.0000000000 1.0000000000 0.3615953720 ) // hex11
    hex ( 29 36 39 30 1 32 35 2 ) ( 28 1 41 ) simpleGrading ( 0.3615953720 1.0000000000 1.0000000000 ) // hex12
);

edges
(
    // piece 1
    arc 1 8 ( 0.0000000000 -0.0002000000 0.2025000000 ) // hex5, hex9
    arc 2 11 ( 0.0000000000 0.0002000000 0.2025000000 )

    arc 8 20 ( 0.1500000000 -0.0002000000 0.0525000000 ) // hex6, hex10
    arc 11 23 ( 0.1500000000 0.0002000000 0.0525000000 )

    arc 29 20 ( 0.0000000000 -0.0002000000 -0.0975000000 ) // hex7, hex11
    arc 30 23 ( 0.0000000000 0.0002000000 -0.0975000000 )

    arc 1 29 ( -0.1500000000 -0.0002000000 0.0525000000 ) // hex8, hex12
    arc 2 30 ( -0.1500000000 0.0002000000 0.0525000000 )

    arc 32 33 ( 0.0000000000 -0.0002000000 0.1050000000 ) // hex9
    arc 35 34 ( 0.0000000000 0.0002000000 0.1050000000 )

    arc 36 37 ( 0.0000000000 -0.0002000000 0.0000000000 ) // hex11
    arc 39 38 ( 0.0000000000 0.0002000000 0.0000000000 )

    arc 33 37 ( 0.0525000000 -0.0002000000 0.0525000000 ) // hex10
    arc 34 38 ( 0.0525000000 0.0002000000 0.0525000000 )

    arc 32 36 ( -0.0525000000 -0.0002000000 0.0525000000 ) // hex12
    arc 35 39 ( -0.0525000000 0.0002000000 0.0525000000 )
);

patches
(
    patch inlet_0
    (
        ( 0 4 7 3 ) // hex1
        ( 28 0 3 31 ) // hex8
        ( 24 28 31 27 ) // hex4
    )

    patch outlet_0
    (
        ( 9 10 14 13 ) // hex2
        ( 21 22 10 9 ) // hex6
        ( 17 18 22 21 ) // hex3
    )

    patch lateralfront_0
    (
        ( 0 1 5 4 ) // hex1
        ( 1 8 12 5 ) // hex5
        ( 8 9 13 12 ) // hex2
        ( 20 21 9 8 ) // hex6
        ( 16 17 21 20 ) // hex3
        ( 25 16 20 29 ) // hex7
        ( 24 25 29 28 ) // hex4
        ( 28 29 1 0 ) // hex8
        ( 32 33 8 1 ) // hex9
        ( 37 20 8 33 ) // hex10
        ( 29 20 37 36 ) // hex11
        ( 29 36 32 1 ) // hex12
    )

    patch lateralback_0
    (
        ( 2 3 7 6 ) // hex1
        ( 11 2 6 15 ) // hex5
        ( 10 11 15 14 ) // hex2
        ( 22 23 11 10 ) // hex6
        ( 18 19 23 22 ) // hex3
        ( 19 26 30 23 ) // hex7
        ( 26 27 31 30 ) // hex4
        ( 30 31 3 2 ) // hex8
        ( 34 35 2 11 ) // hex9
        ( 23 38 34 11 ) // hex10
        ( 23 30 39 38 ) // hex11
        ( 39 30 2 35 ) // hex12
    )

    patch surface_0
    (
        ( 4 5 6 7 ) // hex1
        ( 5 12 15 6 ) // hex5
        ( 12 13 14 15 ) // hex2
    )

    patch bottom_0
    (
        ( 24 25 26 27 ) // hex4
        ( 25 16 19 26 ) // hex7
        ( 16 17 18 19 ) // hex3
    )

    patch cylinder_0
    (
        ( 32 33 34 35 ) // hex9
        ( 38 34 33 37 ) // hex10
        ( 37 36 39 38 ) // hex11
        ( 35 39 36 32 ) // hex12
    )
);

mergePatchPairs
(
);
